Show / Hide Table of Contents
Class CombiInputSIA
Combination according to SIA in the model
Inheritance
System.Object
OpenObject
OpenElementId
CombiInput
CombiInputSIA
Inherited Members
 CombiInput.Name
 CombiInput.Items
 CombiInput.Description
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.CombiInputEC,CI.Loading", "CI.StructModel.Loading.ICombiInput,CI.BasicTypes", typeof(CombiInput))]
public class CombiInputSIA : CombiInput
Constructors
Improve this Doc   View Source
CombiInputSIA()
Constructor
Declaration
public CombiInputSIA()
Properties
Improve this Doc   View Source
TypeCalculationCombi
Type of combination
Declaration
[OpenModelProperty("TypeLinear_Envelope")]
public TypeCalculationCombiSIA TypeCalculationCombi { get; set; }
Property Value
 Type |  Description
 TypeCalculationCombiSIA
Improve this Doc   View Source
TypeCombiSIA
Type of EC combination
Declaration
[OpenModelProperty("TypeCombiEC")]
public TypeOfCombiSIA TypeCombiSIA { get; set; }
Property Value
 Type |  Description
 TypeOfCombiSIA
 Improve this Doc
 View Source